bodys = [
  "やる気についての基本的なことを述べていて、やる気の上げる方は人それぞれ違うということを主張している。この本では、「病気になった患者の医師の対応は患者ぞれぞれ違うように、私たちのやる気の上げ方も人それぞれ違う」とあります。やる気の上げ方も人それぞれ違うため、万人に効果的なやる気の上げ方はなく、単純ではありません。なので、この本を読んでやる気の上げ方の仕組みを理解し、日常に役立てたい", 
  "マインドセットについて述べている。マインドセットは大きく分けて2つあり、証明マインドセットと成長マインドセットである。証明マインドセットは、自分をすごく見せたい、褒められたいと思いたいなど、人に自分の能力を見せつけ認めさせようとします。次に成長マインドセットとは、自分が成長や向上することに焦点を当てていて、他人の評価が重要ではなく、自分が成長できているかが重要だと思っています。この成長マインドセットは、人生を成功させたり、大物、社長になるためには、必要であると考えます。", 
  "証明マインドセットの人の場合は、ビジネスやキャリアを発展させることができません。そのため、ビジネスチャンスを逃したり、業界の成長や発展についていけなくなり、生き残る頃が難しく成功を手にするのは難しいと思います。",
  "最近の若者は・・・」という年配の人が言っていたら、その人は進化に乗り遅れている可能性があると主張している。この考えは、自分の中では新しい考えで興味深い言葉だった。確かに、年配の方が若者よりも優れているところは多くあると思うが、経済や教育は変化しており、それにつれて若者も変化していると考えると、若者の批判は一概に批判はするべきではないと考える。",
  "行動を起こす際に必要なのは、踏み出す勇気ではなく、情報収集である。本書には、「一歩踏み出すにために必要なのは、ポジティブシンキングではなく、ロジカルシンキングだ。」とある。つまり、何か行動を起こす時は、精神面で行動を起こすのではなく、どのようなことをしていくのか、何のために行うのかなど行動に対しての情報が必要である。",
  "集中力についての基本的なことを述べている。人が何か物事に集中する際は、ウィルパワーという思考や感情をコントロールする力を使います。このウィルパワーには一定の量があり、集中力を使う際に消耗していき、睡眠をとることで回復します。このウィルパワーが少ない状態の場合はウィルパワーが底を尽きているので集中するのは難しくなります。また、ウィルパワーは何か我慢したり、何をするか考える際など何かを選択、意思決定をする際にウィルパワーを消耗します。",
  "学歴で稼げるほど世の中は甘くないということだ。学歴がいいからと言って、学歴がお金を稼いでくれる訳ではないし、人生の成功を導いてくれる訳でもない。高学歴でもプライドが高く仕事ができなければ、人生は成功しないし、お金もついてこない。人生の成功は自分の力で切り拓くしかなく、日々前進していくことが大切である。",
  "自分の天井は20代で決まるです。サーカスや動物園の像は意外なくらい細い鎖でしかついていない。それは、子供の頃に細い鎖をつけると、成長して力が強くなっても、その鎖を切って動こうとすることはないそうだ。いざ飛び出そうと思えばできるのだが、像はそうしようとさえ思わなくなるそうです。人間も同じで、20代に描いたビジョンが一生の天井になってしまうと著者は述べている。そのため、規定内に収まるのではなく、高い野望をもち天井を高くしていくことが、今後の人生を変えていく。",
  "人は自分が伝えたいことだけを発信しても、相手には伝わらない。相手に伝えるということは、相手の頭の中に伝えたいことの骨組みや中身を移植していく作業である。また、聞き手である相手は、話を理解できない状態になってしまうと、相手は話の迷子状態になってしまい、話を聞いてくれなくなってしまう。そのため、プレゼンなどで話をする先には、主張を明確にしてそれに基づく根拠、事実を述べていく。そうすることで、相手は結局なにがいいたいの？という状態にならないで自分の主張を理解することができる。",
  "比較するべき人は自身であるということである。他人と比較しながら生活していくと、対人関係の軸が競争になってしまい、悩みから抜け出せず不幸になってしまう。例えば、学校でテストがあったとしたとき、自分は80点であり、友達のAくんは98点であったとする。その時に、自分はAくんより低い点数だったからダメだと思うのではなく、過去の自分の点数に比べてどうだったのかと考えることが大切である。そうすることで、自分は一歩ずつ前に進むことができ、悩みが無くなっていくという考えである。",
  "課題の分離である。課題の分離とは一つの課題があったとして、その課題は誰の課題なのかを考え、もし自分の課題でなければ他者の課題であり、自分はその他者の課題には踏込まないという考えである。この本には、「馬を水辺に連れていくことはできるが水を飲ませることはできない。」という名言がある。つまり、馬を水辺に連れていく援助はすることができるが、水を飲むという行為は馬の課題であり、介入するべきでは無いということである。このように、課題を分けることで衝突が生まれずに、自分が何をやればいいかを考えることができる。",
  "テレビのニュースは良いことに比べて悪いことのニュースを報道していことが多い理由について述べている。悪いニュースが多い理由は、視聴者に見てもらうためだ。悪いことはいいことより頭に残りやすく、視聴者に見てもらい、視聴率を上げるために悪いニュースが多い。そのため、ニュースキャスターは、仕事上そのような悪いニュースを報道しなければならない状態である。また、自然災害での死亡者や、地球温暖化に影響を与えているオゾン層の破壊が、年々減っており、少しずつ良くなってきているがそのような小さな変化はニュースにしない"]



users = [1,2,3,4,5,6,7,8,9,10]

books = [9784478025819,9784761270438,9784478107829,9784837928430,9784866430812,9784908170287,9784866631356,9784833422291]

20.times do |n|
  bd = bodys[n % 11]
  ur = users[n % 10]
  book = books[n % 8]
  Post.create!(
    content: bd,
    book_id: book,
    user_id: ur
  )
end
